% Побудова апроксиманти
% Введення значень змінних х та у
X=[10 30 50 70 90 110 130];
Y=[3.2 11.2 17.2 21.4 24.1 26.1 27.3];
%Запишемо логарифмічні значення змінної х
X1 = log(X);
%Запишемо суми значення змінної Х1
S1 = sum(X1)
S2 = sum(X1.^2)
% Формуємо матрицю А для системи рівнянь визначкння коефіцієнтів апроксиманти
A=[S2 S1; S1 7]
% Формуємо стовпець вільних членів системи
b1=sum(X1.*Y)
b2=sum(Y)
B=[b1;b2]
% Розвязуючи систему рівнянь знаходимо значення коефіцієнтів апроксиманти
K=inv(A)*B
% формула апроксиманти 'y=0.2833*lnx+0.1605'
% Формуємо всі величини для табулювання та побудови графіка апроксиманти
x=0.5:0.5:10;
y=0.2833*log(x)+0.1605;
plot(x,y)
grid on
title('графік апроксиманти')
xlabel('x')
ylabel('y')